In [3]:
import pandas as pd

In [4]:
A = [
[1,5,8,10],
[3,2,2,7],
[7,9,1,2],
[6,8,2,1],
]

In [5]:
df1 = pd.DataFrame(A)
df1

   0  1  2   3
0  1  5  8  10
1  3  2  2   7
2  7  9  1   2
3  6  8  2   1

In [6]:
A

[[1, 5, 8, 10], [3, 2, 2, 7], [7, 9, 1, 2], [6, 8, 2, 1]]

In [16]:
df1 = pd.DataFrame(A,columns=['Col1','Col2','Col3','Col4'],index=['A','B','C','D'])
df1.transpose()

       A  B  C  D
Col1   1  3  7  6
Col2   5  2  9  8
Col3   8  2  1  2
Col4  10  7  2  1

In [9]:
A

[[1, 5, 8, 10], [3, 2, 2, 7], [7, 9, 1, 2], [6, 8, 2, 1]]

In [10]:
import numpy as np

In [11]:
B = np.array(A)

In [12]:
B

array([[ 1,  5,  8, 10],
       [ 3,  2,  2,  7],
       [ 7,  9,  1,  2],
       [ 6,  8,  2,  1]])

In [18]:
df8 = pd.read_csv('Data/movies.csv')
df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7666 entries, 0 to 7665
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   name             7666 non-null   object
 1   rating           7589 non-null   object
 2   genre            7666 non-null   object
 3   year             7666 non-null   int64
 4   release_date     7666 non-null   object
 5   release_country  7666 non-null   object
 6   score            7663 non-null   float64
 7   votes            7663 non-null   float64
 8   director         7666 non-null   object
 9   writer           7663 non-null   object
 10  star             7665 non-null   object
 11  country          7665 non-null   object
 12  budget           5497 non-null   float64
 13  gross            7479 non-null   float64
 14  company          7651 non-null   object
 15  runtime          7664 non-null   float64
dtypes: float64(5), int64(1), object(10)
memory usage: 958.4+ KB